[
    {
        "id": 10,
        "shortBio": "Java Champion, Groovy Enthusiast, Open Source Believer",
        "presentations": [
            {
                "id": 5,
                "title": "Build, Test, and Deploy JavaFX Applications",
                "uri": "http://registration.geecon.cz/rest/1/presentations/5"
            }
        ],
        "bio": "<p>Andres is a Java/Groovy developer and Java Champion, with more than 14 years of experience in software design and development. He has been involved in web and desktop application developments since the early days of Java. He is a true believer of open source and has participated in popular projects like Groovy, Griffon, JMatter and DbUnit, as well as starting his own projects (Json-lib, EZMorph, GraphicsBuilder, JideBuilder). Founding member and current project lead of the Griffon framework.<\/p>",
        "name": "Andres Almiray",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/10_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/10"
    },
    {
        "id": 11,
        "shortBio": "Product management and marketing for IntelliJ IDEA, the most intelligent IDE in the world.",
        "presentations": [
            {
                "id": 6,
                "title": "A Reactive and Type-safe Kotlin DSL for NoSQL and SQL",
                "uri": "http://registration.geecon.cz/rest/1/presentations/6"
            }
        ],
        "bio": "<p>Andrey Cheptsov is a developer and a product manager at <a href=\"http://www.jetbrains.com/\">JetBrains<\/a>. He is responsible for managing both product and marketing for IntelliJ IDEA. Andrey is passionate about productivity, programming languages and tools.<\/p>",
        "name": "Andrey Cheptsov",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/11_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/11"
    },
    {
        "id": 37,
        "shortBio": "Programmer, software craftsman, biker and book lover",
        "presentations": [
            {
                "id": 31,
                "title": "Go! The one language you have to try in 2014",
                "uri": "http://registration.geecon.cz/rest/1/presentations/31"
            }
        ],
        "bio": "<p>I like programming. I do it a lot, mostly on the JVM, usually writing fancy backends for big, distributed systems.<\/p><p>\r\nI also display a particular affection to continuous delivery.. UI, unless quickly hacked, is not my play ;-) I believe that most problems we deal with are people problems, so I mix and match tools with technologies to achieve my goals, make people happy and achieve world peace :-) I believe in software quality, and organize GeeCON, Polish JUG, Krakow Software Craftsmanship, Cracow Hadoop User Group. In my free time, I read paper books and cycle, a lot!<\/p>",
        "name": "Andrzej Grzesik",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/37_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/37"
    },
    {
        "id": 26,
        "shortBio": "Software engineer and product manager at ZeroTurnaround. Java enthusiast and IntelliJ IDEA addict. ",
        "presentations": [
            {
                "id": 21,
                "title": "Having fun with Javassist ",
                "uri": "http://registration.geecon.cz/rest/1/presentations/21"
            }
        ],
        "bio": "<p>Anton is a software engineer and product manager at ZeroTurnaround. His professional interests include programming laguages, middleware and tooling. Java enthusiast, vim fan, IntelliJ IDEA addict. He blogs at <a href=\"http://arhipov.blogspot.com\">http://arhipov.blogspot.com<\/a>, speaks at Java conferences, and occasionally writes for RebelLabs at <a href=\"http://rebellabs.org\">http://rebellabs.org<\/a>. Anton is also involved with GeekOut Java conference and DevClub.eu meetup organization in Tallinn, Estonia. He tweets from @antonarhipov and you can find him at <a href=\"http://linkd.in/aarhipov\">LinkedIn<\/a><\/p>",
        "name": "Anton Arhipov",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/26_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/26"
    },
    {
        "id": 2,
        "shortBio": "Author of Thinking in Java and Atomic Scala. Founding member of the ANSI/ISO C++ committee. Trainer and consultant.",
        "presentations": [],
        "bio": "<p>Bruce Eckel (<a href=\"http://www.BruceEckel.com\">www.BruceEckel.com<\/a>) is the author (with Dianne Marsh) of <a href=\"http://www.atomicscala.com/\">Atomic Scala<\/a>, Thinking in Java (Prentice-Hall, 1998, 2nd Edition, 2000, 3rd Edition, 2003, 4th Edition, 2006), the Hands-On Java eSeminar (available on the Web site), Thinking in C++ (PH 1995; 2nd edition 2000, Volume 2 with Chuck Allison, 2003), C++ Inside & Out (Osborne/McGraw-Hill 1993), and First Steps in Flex (with James Ward, 2008) among others. He's given hundreds of presentations throughout the world, published over 150 articles in numerous magazines, was a founding member of the ANSI/ISO C++ committee and speaks regularly at conferences. He was for many years the chair of both the C++ and Java tracks at the Software Development conference, is cofounder of the JavaPosse Roundup Conference and creator of the Scala Summit Conference. He provides public and private training and consulting in programming languages and software system design.<\/p>",
        "name": "Bruce Eckel",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/2_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/2"
    },
    {
        "id": 4,
        "shortBio": "Expert in Java Service Delivery Platforms, IMS, and SOA into the communication’s market. Building out Java infrastructure for Next Generation Networks.",
        "presentations": [
            {
                "id": 36,
                "title": "Real Time Communications on the Web",
                "uri": "http://registration.geecon.cz/rest/1/presentations/36"
            }
        ],
        "bio": "<p>Setting the telecommunications marketing strategy for Oracle and the industry, Mr Tait is defining and building out the Service/Application infrastructure for Next Generation Networks.  As Global Director of Marketing for Oracle Communications, Mr Tait is driving the strategy and tactics for Service Delivery Platforms, Service Brokering, and WebRTC. \r\n<\/p>\r\n<p>Prior to Oracle, Mr Tait was the director for Global Telecom Markets at BEA and founded the JAIN initiative defining Java™ technology for communications at Sun. He organized international standards, community, and user group meetings for creating standards and driving the communications market toward standard based interfaces, platforms, and protocols.<\/p>",
        "name": "Douglas Tait",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/4_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/4"
    },
    {
        "id": 5,
        "shortBio": "Gerrit leads the JUG Münster, is a JavaOne Rockstar and Java Champion. He is interested in Java in the IoT area and JavaFX.",
        "presentations": [
            {
                "id": 1,
                "title": "\"Catch me if you can\" - Java on wearables",
                "uri": "http://registration.geecon.cz/rest/1/presentations/1"
            }
        ],
        "bio": "<p>Gerrit Grunwald is a software engineer with more than 10 years of experience in software development. He has been involved in Java desktop application and controls development. His current interests include Java in IoT, JavaFX and HTML5, especially development of custom controls in these technologies. Grunwald is also interested in Java-driven embedded technologies. He is a true believer in open source and has participated in popular projects like JFXtras.org as well as his own projects (Enzo, SteelSeries Swing, SteelSeries Canvas). Gerrit is an active member of the Java community, where he founded and leads the Java User Group Münster (Germany), he co-leads the JavaFX and IoT community, is a JavaOne rockstar and Java Champion. He is a speaker at conferences and user groups internationally.<\/p>",
        "name": "Gerrit Grunwald",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/5_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/5"
    },
    {
        "id": 6,
        "shortBio": "Java, Concurrency, Performance, TDD.",
        "presentations": [
            {
                "id": 2,
                "title": "Java Concurrency Under the Hood",
                "uri": "http://registration.geecon.cz/rest/1/presentations/2"
            }
        ],
        "bio": "<p>Dealing with stability-critical high-performance applications, including, but not limited to financial systems, for a number of years. A fierce practitioner of TDD. Actively promoting Mutation Analysis and raising Parallel Programming knowledge level in russian-speaking JUGs, mainly via articles and talks. Currently employed at Deutsche Bank.<\/p>",
        "name": "Gleb Smirnov",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/6_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/6"
    },
    {
        "id": 22,
        "shortBio": "Group Community Manager, Java Community Process",
        "presentations": [
            {
                "id": 18,
                "title": "JCP, Adopt-a-JSR & You",
                "uri": "http://registration.geecon.cz/rest/1/presentations/18"
            }
        ],
        "bio": "<p>Heather VanCura manages the JCP Community and Program Office. In her role she is responsible for the day-to-day nurturing, support, and leadership of the community. Heather oversees the JCP.org web site, JSR management, community building, events, marketing, communications, and growth of the membership. She is also a contributor and leader of the community driven Adopt-a-JSR programs. In 2014, Heather became Spec Lead for JSR 364, Broadening JCP Membership, as part of the ongoing JCP.Next effort. Heather is passionate about Java and developer communities. She enjoys trying new sports and fitness activities in her free time and speaking at conferences, such as FOSDEM, Devoxx, GeeCon, JFokus, Java Zone, OSCON and the JavaOne Conferences.<\/p>\r\n",
        "name": "Heather VanCura",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/22_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/22"
    },
    {
        "id": 9,
        "shortBio": "Geek, Father, Groovy & Grails Developer, Sysadmin, Linux-lover, Pro-Opensource, Lord of Sealand and creator of Bokzuy.com.",
        "presentations": [
            {
                "id": 3,
                "title": "Metaprogramming with Groovy",
                "uri": "http://registration.geecon.cz/rest/1/presentations/3"
            }
        ],
        "bio": "<p>Iván is a Software Engineer and Systems Administrator with 11 years of experience. He discovered Grails 4 years ago and since then he develops almost exclusively using Groovy. He is the creator of <a href=\"http://www.bokzuy.com\">Bokzuy.com<\/a> and some Grails plugins like Postgresql-Extensions and Slug-Generator.\r\n<\/p><p>\r\nHe's also the coordinator of the Madrid Groovy User Group (@madridgug) and the co-organizer of the Greach Conference (<a href=\"http://greach.es\">http://greach.es<\/a>).\r\n<\/p>\r\n\r\n",
        "name": "Iván López",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/9_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/9"
    },
    {
        "id": 32,
        "shortBio": "Architect, programmer, manager, technical trainer, tech lead, wannabe entrepreneur, JUG member. There is a fair chance I do none of those right",
        "presentations": [
            {
                "id": 28,
                "title": "JEE'ish development without a hassle",
                "uri": "http://registration.geecon.cz/rest/1/presentations/28"
            }
        ],
        "bio": "<p>Jakub has been around software development for past 10 years, wearing multiple hats, getting hands dirty in multiple environments, securing both technical as well as the business side of The Thing. “An engineer with a human friendly interface?”. Some languages, some frameworks, blah blah blah - doesn’t matter.<\/p>\r\n\r\n<p>Jakub always considered programming as a tool to solve real-life problems - in a pragmatic way. He always stayed closed to business side of the solution, still focusing on the technology. He combines daily job of managing a horde of software engineers at Young Digital Planet with lectures and technical trainings and comittment to Gdańsk Java User Group.<\/p>",
        "name": "Jakub Marchwicki",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/32_speaker.jpeg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/32"
    },
    {
        "id": 13,
        "shortBio": "Senior consultant, software architect, programming language nerd, game dev by night, fitness enthusiast and proud father of two.",
        "presentations": [
            {
                "id": 7,
                "title": "Pragmatic Architecture for Agile Teams",
                "uri": "http://registration.geecon.cz/rest/1/presentations/7"
            }
        ],
        "bio": "<p>Janne Sinivirta is a senior consultant for Nitor Creations. Software architect, programming language nerd, fitness enthusiast and a proud father of two. With 17 years of professional programming, he has been responsible for architectural design and software development in business management, healthcare, telecomm, media, interactive television, mobile entertainment and other IT industries. For the past few years, he has spent much of his free time developing games for mobile devices in various languages.\r\n<\/p>\r\n",
        "name": "Janne Sinivirta",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/13_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/13"
    },
    {
        "id": 29,
        "shortBio": "JEE Developer  who spreads anarchy in JDK",
        "presentations": [
            {
                "id": 25,
                "title": "Doing WEB  development clean way",
                "uri": "http://registration.geecon.cz/rest/1/presentations/25"
            }
        ],
        "bio": "<p>I am Java Developer since 1999. I love programming since my first line of code I did on C64  in Basic. I have 14 Years experience s developing JEE software working for various companies and projects. For last 3 years I am working at Capgemini in Wroclaw as Technical Architect.<\/p><p>\r\nI do design, lead teams and provide coaching and training inside company. I like to present my experience in public (Wroclaw JUG, DevCrowd 2013 , Akademia Capgemini, Capgemini Tech Talks). <\/p><p>\r\nI like to do shows - presenting the things just as they work – with live coding, demos and hacking.  So: expect everything but the boring slideshow.<\/p><p>\r\n\r\nSome of my creations:\r\n<li><a href=\"http://www.setblack.pl/aterchart-web/content/html5academy/css/tictactoe.html\">Pure CSS3/HTML Game<\/a><\/li><li> <a href=\"http://csscraft.setblack.pl/\">Game for CSS Developers<\/a><\/li>\r\n<\/p>\r\n",
        "name": "Jarek Ratajski",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/29_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/29"
    },
    {
        "id": 3,
        "shortBio": "NetBeans founder and NetBeans Platform Architect ",
        "presentations": [
            {
                "id": 32,
                "title": "How to develop Java apps for iOS, Android, FX and more in NetBeans",
                "uri": "http://registration.geecon.cz/rest/1/presentations/32"
            }
        ],
        "bio": "<p>\r\nJaroslav Tulach is the founder and initial architect of NetBeans, which is not just a well known IDE, but also the first modular desktop application framework written in Java. \r\nJaroslav is responsible for many NetBeans APIs and for teaching the rest of team to know how to write good ones. He is the last NetBeans founder still involved with the project. \r\n<\/p>",
        "name": "Jaroslav Tulach",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/3_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/3"
    },
    {
        "id": 39,
        "shortBio": "Software developer at SoftwareMill",
        "presentations": [
            {
                "id": 34,
                "title": "Make and Conquer: Start making your own things",
                "uri": "http://registration.geecon.cz/rest/1/presentations/34"
            }
        ],
        "bio": "<p>Software developer. Right now it is Java, but in the past things changed a lot. It all started with a C64 and Basic when he was 9 years old. Glory times when GOTO was not prohibited but a good practice.\r\n<\/p><p>\r\nWorking remotely, typically from home, with people who care. We are SoftwareMill.\r\n<\/p><p>\r\nWhen not husbanding, parenting and hard working, he tries to keep up with the latest stuff happening in IT.<\/p>",
        "name": "Jarosław Kijanowski",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/39_speaker.JPG",
        "uri": "http://registration.geecon.cz/rest/1/speakers/39"
    },
    {
        "id": 31,
        "shortBio": "RnD Team Lead at Y Soft responsible for development environment.",
        "presentations": [
            {
                "id": 27,
                "title": "Bigger and better Y Soft RnD with full Atlassian stack",
                "uri": "http://registration.geecon.cz/rest/1/presentations/27"
            }
        ],
        "bio": "Juraj and his team have responsibility for developing and deploying changes into RnD environment. It's challenging task to balance compatibility with old environment and bring new technologies so developers can work in more effective way. ",
        "name": "Juraj Michálek",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/31_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/31"
    },
    {
        "id": 35,
        "shortBio": "Java&C++ coder of low-latency trading system, beer lover",
        "presentations": [
            {
                "id": 29,
                "title": "Low-latency trading system in Java - SubM",
                "uri": "http://registration.geecon.cz/rest/1/presentations/29"
            }
        ],
        "bio": "<p>He is  developing in Java and C++ for 10years. He worked on projects from recording VoIP, Business Support & Control Systems for mobile operators.<\/p><p>\r\n\r\nLast 2years he spends his time to understand low-latency trading systems in Barclays and he is looking for ways how to make them run faster.<\/p><p>\r\n\r\n\r\nHe would like to play more with Arduino, but he has lack of time. Father of 3 kids, who is trying to run.<\/p>",
        "name": "Karel Rank",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/35_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/35"
    },
    {
        "id": 44,
        "shortBio": "Product Owner/Conference Speaker ",
        "presentations": [
            {
                "id": 38,
                "title": "Agile Project Management Anty-Patterns",
                "uri": "http://registration.geecon.cz/rest/1/presentations/38"
            }
        ],
        "bio": "Kasia is an IT, management & agile passionate. For Kasia sky is the limit, so she moved to the clouds… and aviation business. Currently she works for a factory producing billions of lines of code which magically turn into working software.",
        "name": "Katarzyna Mrowca",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/44_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/44"
    },
    {
        "id": 46,
        "shortBio": "Developer Advocate at Typesafe.",
        "presentations": [
            {
                "id": 40,
                "title": "Go Reactive! Reactive web application development with Scala, Play, and Akka",
                "uri": "http://registration.geecon.cz/rest/1/presentations/40"
            }
        ],
        "bio": "Kevin Webber is a Developer Advocate at Typesafe. He has over fourteen years of Java development, team lead, and consulting experience in the Canadian banking and e-commerce industries. Prior to joining Typesafe he lead a team of developers that replaced Walmart Canada’s ATG based e-commerce platform with a custom Reactive web application using Scala and the Play framework.",
        "name": "Kevin Webber",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/46_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/46"
    },
    {
        "id": 34,
        "shortBio": "hAkker @ Typesafe; Passionate late-night dev; Fan of Distributed Systems and Capybaras",
        "presentations": [
            {
                "id": 42,
                "title": "Reactive streams and Akka streams",
                "uri": "http://registration.geecon.cz/rest/1/presentations/42"
            }
        ],
        "bio": "<p>Konrad is a late-night passionate dev living by the motto \"Life is Study!\", hakking on the Akka toolkit at Typesafe.<\/p>\r\n\r\n<p>His favourite discussion topics range from distributed systems to capybaras. He's a very active member of the polish IT community, co-leading or founding multiple technology user groups in Kraków. Over the last years he's been presenting at conferences such as: GeeCON, JavaOne SF, JFokus or Devoxx.<\/p>\r\n\r\n<p>In those rare times he's not coding, he spreads the joy of computer science, through helping local user groups and whitepaper reading clubs<\/p>",
        "name": "Konrad Malawski",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/34_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/34"
    },
    {
        "id": 45,
        "shortBio": "Technical enthusiast, software engineer and product owner of Service Bootstrap developed in Allegro.",
        "presentations": [
            {
                "id": 39,
                "title": "Base for microservices",
                "uri": "http://registration.geecon.cz/rest/1/presentations/39"
            }
        ],
        "bio": "Technical enthusiast, software engineer and product owner of Service Bootstrap developed in Allegro . \r\nGained software experience in the biggest polish web companies – Onet.pl and Allegro.pl. \r\nHe has a lot of experience in designing and building modern, scalable web systems. \r\nHe is open to all new technologies an programming languages and he has no fear to work on legacy systems and rewrite it in modern way.",
        "name": "Krzysztof Debski",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/45_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/45"
    },
    {
        "id": 15,
        "shortBio": "I'm one of the rare SQL aficionados in the Java ecosystem.",
        "presentations": [
            {
                "id": 10,
                "title": "2000 Lines of Java? Or 50 Lines of SQL? The Choice is Yours",
                "uri": "http://registration.geecon.cz/rest/1/presentations/10"
            }
        ],
        "bio": "<p>I am the founder and CEO of Data Geekery GmbH, located in Zurich, Switzerland. With my company we have been selling database products and services around Java and SQL since 2013.\r\n<\/p><p>\r\nEver since my Master’s studies at EPFL in 2006, I have been fascinated by the interaction of Java and SQL. Most of this experience I have obtained in the Swiss E-Banking field through various variants (JDBC, Hibernate, mostly with Oracle). I am happy to share this knowledge at various conferences, JUGs, in-house presentations and on my blog. Here’s my conference and JUG talk schedule for the most recent time: <a href=\"http://www.jooq.org/news\">http://www.jooq.org/news<\/a>.<\/p>",
        "name": "Lukas Eder",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/15_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/15"
    },
    {
        "id": 21,
        "shortBio": "Frontend master and a testing geek, an open source addicted father and Red Hatter",
        "presentations": [
            {
                "id": 17,
                "title": "One ring to... notify them all: Unified Push for Mobile Devices",
                "uri": "http://registration.geecon.cz/rest/1/presentations/17"
            }
        ],
        "bio": "<p>Lukáš is a frontend master and a testing geek working at JBoss / Red Hat on mobile/web related projects such as AeroGear, Arquillian extensions or previously RichFaces.\r\n<\/p>\r\n<p>Lukáš frequently speaks about web/hybrid mobile development, HTML5, Java EE, best practices and test driven development.<\/p>",
        "name": "Lukáš Fryč",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/21_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/21"
    },
    {
        "id": 14,
        "shortBio": "jBPM Core Developer.",
        "presentations": [
            {
                "id": 8,
                "title": "jBPM: The BPM Swiss Knife",
                "uri": "http://registration.geecon.cz/rest/1/presentations/8"
            }
        ],
        "bio": "<p>Maciej is software engineer working as core developer of jBPM. Since 2007 he is in BPM domain both from development point of view and helping to adopt BPM in different sectors. He's passionate about open source and tries to promote it wherever possible. In his spare time he enjoys calm and relax life on country side and travels.<\/p>",
        "name": "Maciej Świderski",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/14_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/14"
    },
    {
        "id": 16,
        "shortBio": "Java EE enthusiast, a father, dreamer, doer, writer, speaker, Java Champion, JUG leader and Red Hatter.",
        "presentations": [
            {
                "id": 11,
                "title": "50 new features of Java EE 7",
                "uri": "http://registration.geecon.cz/rest/1/presentations/11"
            }
        ],
        "bio": "<p>Markus is a Developer Advocate at Red Hat and focuses on JBoss Middleware. He is working with Java EE servers from different vendors since more than 14 years and talks about his favorite topics around Java EE on conferences all over the world. He has been a principle consultant and worked with different customers on all kinds of Java EE related applications and solutions. Beside that he has always been a prolific blogger, writer and tech editor for different Java EE related books. He is the Java Community leader of the German DOAG e.V. and it's representative on the iJUG e.V. As a Java Champion and ACE Director he is well known in the community.<\/p>",
        "name": "Markus Eisele",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/16_speaker.jpeg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/16"
    },
    {
        "id": 17,
        "shortBio": "Java enthusiastic, OpenSource committer, Technical reviewer, Community/Conference/JUG speaker, Presenter.",
        "presentations": [
            {
                "id": 12,
                "title": "When assertThat(you).understandUnitTesting() fails",
                "uri": "http://registration.geecon.cz/rest/1/presentations/12"
            }
        ],
        "bio": "<p>Java enthusiastic, OpenSource committer, Technical reviewer, Community/Conference/JUG speaker, Presenter.\r\n<\/p>\r\n<p>\r\nOpen Source committer:\r\n<lu>\r\n<li> to Gephi project as part of Google Summer of Code\r\n<\/li><li> to NetBeans project as part of NetCAT 7.2 and 7.3 programs\r\n<\/li><li> to Abego Tree Layout for \"Mavenizing\" the project\r\n<\/li><li> to AST visualizer project as main developer\r\n<\/li><li> to Project Tyrus for build infrastructure and documentation improvements\r\n<\/li>\r\n<\/lu>\r\n<\/p>\r\n",
        "name": "Martin Skurla",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/17_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/17"
    },
    {
        "id": 27,
        "shortBio": "Software engineer interested in bleeding-edge technologies, always craving new toys to play with especially in the Java world.",
        "presentations": [
            {
                "id": 23,
                "title": "Good, Better, PerfCake",
                "uri": "http://registration.geecon.cz/rest/1/presentations/23"
            }
        ],
        "bio": "<p>Experienced team leader of several Quality Assurance teams for various JBoss Middleware products from both technical and people manager point of view.\r\nAn autocratic manager of the best performance testing tool PerfCake.<\/p>",
        "name": "Martin Večeřa",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/27_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/27"
    },
    {
        "id": 30,
        "shortBio": "Software Engineer at Red Hat who worked on several open-source projects, including Weld, JBoss Forge and Windup.",
        "presentations": [
            {
                "id": 26,
                "title": "JBoss Forge – building apps happens to be fun",
                "uri": "http://registration.geecon.cz/rest/1/presentations/26"
            }
        ],
        "bio": "<p>I come from Košice, Slovakia. During my last year of studies at Masaryk University, I worked as an intern at Red Hat.\r\nAfter I graduated, I was converted to a Software Engineer. Thanks to this position, I was already able to help with several open-source projects, including Weld, JBoss Forge and Windup.<\/p>\r\n\r\n<p>Besides programming, I also enjoy movie making. I am a member of the <a href=\"http://www.brnotoastmasters.cz/\">Brno Toastmasters group<\/a>.<\/p>",
        "name": "Matej Briškár",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/30_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/30"
    },
    {
        "id": 12,
        "shortBio": "Objective: Delivering end user happiness",
        "presentations": [
            {
                "id": 9,
                "title": "Do-It-Yourself Usability Design for Developers",
                "uri": "http://registration.geecon.cz/rest/1/presentations/9"
            }
        ],
        "bio": "<p>Michael is a user interface creator by passion. He is convinced: no matter which technology and which device, if it has a screen, one can build a truly amazing experience. And pure magic.<\/p>\r\n<p>\r\nMichael works at Canoo as a software engineer on next generation user interfaces. Before that, he was responsible for performance optimization of JavaFX Mobile at Sun Microsystems and later became the technical lead of the JavaFX core components at Oracle.<\/p>\r\n<p>\r\nMichael loves to spend time with his family and cooking. You can find him on Twitter @net0pyr and occasionally he blogs at <a href=\" http://blog.netopyr.com\">http://blog.netopyr.com<\/a><\/p>",
        "name": "Michael Heinrichs",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/12_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/12"
    },
    {
        "id": 43,
        "shortBio": "JVM enthusiast, Machine-learning(AI) fun and Developer. Everything has its state not only in the JVM machine.",
        "presentations": [
            {
                "id": 37,
                "title": "The Robot under dictate of the LegoMindStorm + Java Concurrency API: Let’s shift the future!",
                "uri": "http://registration.geecon.cz/rest/1/presentations/37"
            }
        ],
        "bio": "<p>Miroslav is passionate JVM enthusiast since the 1st moment he joined SUN Microsystems at 2002. Miroslav truly believes in distributed system design, concurrency and parallel computing, which pushing the system performances to their limits without losing their reliability and stability. Trust is almost equal to the proper system tests (never trust without testing it). Miroslav is big fun of Agile development methodologies, Clean Code, Patterns and he is also one of core GeeCON co-founders. During his career at SUN, PhD., Freelancer  or Software Architect/Developer he was speaking at various european JUGs, Universities and conferences. <\/p><p>\r\nMiroslav’s big interest belongs for the last several years to Machine-Learning techniques, Data-Mining and Distributed systems with high information transmission abilities. One of Miroslav’s motto is that language doesn't matter, change perspective to achieve the goal properly when compatibility is there (JVM ~ Java, Scala, JRuby… + we have APIs), develop once and run.<\/p>",
        "name": "Miroslav Kopecky",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/43_speaker.jpeg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/43"
    },
    {
        "id": 25,
        "shortBio": "ThoughtWorker, software architectat, consultant, speaker, writer.",
        "presentations": [
            {
                "id": 43,
                "title": "This is Water",
                "uri": "http://registration.geecon.cz/rest/1/presentations/43"
            },
            {
                "id": 44,
                "title": "Functional Thinking in Java 8, Clojure, Groovy, and Scala",
                "uri": "http://registration.geecon.cz/rest/1/presentations/44"
            }
        ],
        "bio": "<p>Neal Ford is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, magazine articles, video/DVD presentations, and author and/or editor of eight books spanning a variety of subjects and technologies, including the most recent <a href=\"http://presentationpatterns.com/\">Presentation Patterns<\/a> and <a href=\"http://nealford.com/books/functionalthinking.html\">Functional Thinking<\/a>. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 300 developer conferences worldwide, delivering more than 2000 presentations. Check out his web site at <a href=\"http://nealford.com/\">nealford.com<\/a>. He welcomes feedback and can be reached at nford@thoughtworks.com.<\/p>",
        "name": "Neal Ford",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/25_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/25"
    },
    {
        "id": 23,
        "shortBio": "Troubleshooter and Master Developer in Plumbr",
        "presentations": [
            {
                "id": 19,
                "title": "I bet you have a memory leak",
                "uri": "http://registration.geecon.cz/rest/1/presentations/19"
            }
        ],
        "bio": "<p>Co-founder of Plumbr, the memory leak detection product, where he now contributes as core developer. Besides his daily technical tasks he is an active blogger, JavaOne RockStar and frequent conference speaker  (Devoxx, JavaOne SF/Russia, GeeCon, 33rd Degree, TopConf, JavaDay, GeekOut, Joker, Jazoon, JPoint etc).<\/p>\r\n\r\n<p>Prior to founding Plumbr, Nikita was a Java EE developer and performance consultant in the Baltics, and has worked with tens of different Java EE applications over the years. In the last four years he specialized in troubleshooting and performance optimization.<\/p>",
        "name": "Nikita Salnikov-Tarnovski",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/23_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/23"
    },
    {
        "id": 24,
        "shortBio": "Lead Performance Engineer at Azul Systems",
        "presentations": [
            {
                "id": 20,
                "title": "The Illusion of Execution",
                "uri": "http://registration.geecon.cz/rest/1/presentations/20"
            }
        ],
        "bio": "<p>A coder with a pedantic passion for performance. My work has spanned army intelligence systems, dot.com era startups, financial institutions and innovative product companies.\r\nAlso a blogger and active Open Source developer (importantly JCTools but also modest contributor to RxJava/Netty/Akka and others)<\/p>\r\n",
        "name": "Nitsan Wakart",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/24_speaker.JPG",
        "uri": "http://registration.geecon.cz/rest/1/speakers/24"
    },
    {
        "id": 18,
        "shortBio": "Oleg is a Java developer, Evangelist and RebelLabs editor at ZeroTurnaround.",
        "presentations": [
            {
                "id": 13,
                "title": "Unlocking the Magic of Monads in Java 8",
                "uri": "http://registration.geecon.cz/rest/1/presentations/13"
            }
        ],
        "bio": "<p>Oleg is a Java developer, Evangelist and RebelLabs editor at ZeroTurnaround, with a focus on Continuous Delivery and Devops. He also enjoys spending time using Clojure, Github and Google Docs. He is currently studying for a PhD on dynamic system updates and process migration and is a part-time teacher at the University of Tartu. As a technical writer for RebelLabs, Oleg regularly provides content for blogs and popular reports. In his free time he plays chess at a grandmaster level, loves puzzles and solving problems. He is a geek but loves to hang out with people.<\/p>",
        "name": "Oleg Šelajev",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/18_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/18"
    },
    {
        "id": 7,
        "shortBio": "Spring Data Project Lead, OpenSource enthusiast, drummer… Soul Power!",
        "presentations": [
            {
                "id": 22,
                "title": "Whoops! Where did my architecture go?",
                "uri": "http://registration.geecon.cz/rest/1/presentations/22"
            }
        ],
        "bio": "<p>Oliver Gierke is the lead of the Spring Data project at Pivotal, formerly known as SpringSource, and member of the JPA 2.1 expert group. He has been into developing enterprise applications and open source projects for over 8 years now. His working focus is centered around software architecture, Spring and persistence technologies. He is regularly speaking at German and international conferences as well as author of technology articles and the first book on Spring Data.<\/p>",
        "name": "Oliver Gierke",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/7_speaker.jpeg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/7"
    },
    {
        "id": 42,
        "shortBio": "OOP and Functional Programming enthusiast, Passionate Teacher, Software Architect and proud YSofter.",
        "presentations": [],
        "bio": "<p>OOP and Functional Programming enthusiast, Passionate Teacher, Software Architect and proud YSofter. I am working with my colleagues on the technology behind Y Soft products, helping turn the product visions of startups into reality and work with biggest Y Soft customers. I used to be a manager and I no longer am one, but I enjoy work which connects people and technology. My professional interests are Software Quality, Scalable Systems and Functional Programming. I have recently switched from VIM to EMACS and I still wondering, what that says about myself.<\/p>",
        "name": "Ondřej Krajíček",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/42_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/42"
    },
    {
        "id": 28,
        "shortBio": "Senior QA engineer focusing on performance at JBoss. Core developer of the PerfCake.",
        "presentations": [
            {
                "id": 24,
                "title": "Good, Better, PerfCake",
                "uri": "http://registration.geecon.cz/rest/1/presentations/24"
            }
        ],
        "bio": "Pavel is a senior QA engineer working in Red Hat as a part of the JBoss QE team with the main focus on performance for over 5 years. He is also one of the core developers of the PerfCake performance testing framework.",
        "name": "Pavel Macík",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/28_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/28"
    },
    {
        "id": 1,
        "shortBio": "Coauthor of Java 8 in Action, researcher, speaker and instructor.",
        "presentations": [],
        "bio": "<p>Raoul-Gabriel Urma is a coauthor of the upcoming book Java 8 in Action: Lambdas, Streams, and functional-style programming, published by Manning. He is a regular speaker at major Java conferences (for example, Devoxx and Fosdem) and also an instructor. He has worked at several well-known companies — including Google's Python team, Oracle's Java Platform group, eBay, and Goldman Sachs — as well as for several startup projects. Currently, he is finishing a PhD in computer science at the University of Cambridge, where he does research in programming languages.<\/p>",
        "name": "Raoul-Gabriel Urma",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/1_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/1"
    },
    {
        "id": 36,
        "shortBio": "Senior software architect, trainer, process engineer and automation enthusiast at Tieto Czech",
        "presentations": [
            {
                "id": 30,
                "title": "Extinction of Dinosaurs -> Rise of Microservices",
                "uri": "http://registration.geecon.cz/rest/1/presentations/30"
            }
        ],
        "bio": "<p>Roman is a software architect with 13 years of experience on several Java projects. Since 2007 he is lead person in a project for Scandinavian mobile operator with responsibility for ordering and CRM system quality and operations. Roman is also a member of Ostrava local JUG community where he had few speeches on several topics and led several open space chat groups.<\/p>",
        "name": "Roman Bosák",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/36_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/36"
    },
    {
        "id": 47,
        "shortBio": "Senior architect at Xebia, Devops and open source enthousiast",
        "presentations": [
            {
                "id": 41,
                "title": "Predicting passenger fares from the users logs",
                "uri": "http://registration.geecon.cz/rest/1/presentations/41"
            }
        ],
        "bio": "Séven is senior architect at Xebia with more than 10 years of experience in Java Technologies. Early adopter of the DevOps philosophy, he co-authored the Xebia DevOps Tech Trends published last year. Séven has great experience in high traffic web sites for telco and large travel agencies. He is a full stack architect that love to work at every level of the production process from dev to ops. As a DevOps evangelist, he naturally embraces cloud computing for its customers. Séven is also author of open source projects like Selma and Logfilter, and regularly runs open workshops on web architecture (Aws, NginX, Varnish).",
        "name": "Séven Le Mesle",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/47_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/47"
    },
    {
        "id": 41,
        "shortBio": "Independent consultant specializing in high-scale enterprise systems. Speaker, instructor and author.",
        "presentations": [],
        "bio": "<p>Ted Neward is an independent consultant specializing in high-scale enterprise systems, working with clients ranging in size from Fortune 500 corporations to small 10-person shops. He is an authority in Java and .NET technologies, particularly in the areas of Java/.NET integration (both in-process and via integration tools like Web services), back-end enterprise software systems, and virtual machine/execution engine plumbing.<\/p>\r\n<p>\r\nHe is the author or co-author of several books, including Effective Enterprise Java, C# In a Nutshell, SSCLI Essentials, Server-Based Java Programming, and a contributor to several technology journals. Ted is also a Microsoft MVP Architect, BEA Technical Director, INETA speaker, former DevelopMentor instructor, frequent worldwide conference speaker, and a member of various Java JSRs. He lives in the Pacific Northwest with his wife, two sons, and eight PCs.<\/p>",
        "name": "Ted Neward",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/41_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/41"
    },
    {
        "id": 38,
        "shortBio": "Founder of Softwaremill, agile enthusiast, software developer.",
        "presentations": [
            {
                "id": 33,
                "title": "Make and Conquer: Start making your own things",
                "uri": "http://registration.geecon.cz/rest/1/presentations/33"
            }
        ],
        "bio": "<p>I have been working on almost all steps of the Software Engineer career ladder. Starting from intern at JBoss, a division of RedHat, ranging to Application Architect in a big financial institution in South Africa.\r\n<\/p><p>\r\nIn the meantime I have started a company which aims at creating a cool place to work at.\r\n<\/p><p>\r\nI believe in agile methodologies, good code and communities. For the last I have been leader of Warsaw JUG for many years, and recently I have started Warsaw Groovy User Group.<\/p>",
        "name": "Tomasz Szymanski",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/38_speaker.JPG",
        "uri": "http://registration.geecon.cz/rest/1/speakers/38"
    },
    {
        "id": 8,
        "shortBio": "A passionate programmer who develops with pleasure.",
        "presentations": [
            {
                "id": 4,
                "title": "JetBrains MPS - Speaking your language",
                "uri": "http://registration.geecon.cz/rest/1/presentations/4"
            }
        ],
        "bio": "<p>Václav is a programming enthusiast who develops with pleasure ;-). He's keenly interested in server-side Java technologies, distributed and concurrent systems, modern programming languages and DLSs. He joined JetBrains on a mission to empower developers with top-notch development tools. He's currently involved in the MPS project, developing a projectional DSL workbench and building customized DSLs.<\/p>",
        "name": "Václav Pech",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/8_speaker.png",
        "uri": "http://registration.geecon.cz/rest/1/speakers/8"
    },
    {
        "id": 40,
        "shortBio": "Software developer working for Barclays. Computer chess enthusiast. ",
        "presentations": [
            {
                "id": 35,
                "title": "Lockless hashmap implementation",
                "uri": "http://registration.geecon.cz/rest/1/presentations/35"
            }
        ],
        "bio": "I am a software developer with more than 6 years of professional experience. I worked on projects like <a href=\"http://www8.hp.com/us/en/software-solutions/service-virtualization/\">HP Service Virtualization<\/a> or SubM - Barclays' low-latency direct market access platform. Whereas my professional career taught me what the real world challenges are, my hobby has always been to explore more theoretical problems. Most importantly this means computer chess. I run my personal <a href=\"https://sites.google.com/site/virutor/\">chess project<\/a> and recently I started <a href=\"virutorchess.blogspot.com\">blogging<\/a> about the topic.",
        "name": "Václav Vávra",
        "photo": "http://s3-eu-west-1.amazonaws.com/speakers2014prague/40_speaker.jpg",
        "uri": "http://registration.geecon.cz/rest/1/speakers/40"
    }
]